atc1441/CH559sdccUSBHost/CH559.h
/*  FlashROM and Data-Flash Registers  */
SFR16(ROM_ADDR,	0x84);	// address for flash-ROM, little-endian
SFR(ROM_ADDR_L,	0x84);	// address low byte for flash-ROM
SFR(ROM_ADDR_H,	0x85);	// address high byte for flash-ROM
SFR16(ROM_DATA,	0x8E);	// data for flash-ROM writing, little-endian
SFR(ROM_DATA_L,	0x8E);	// data low byte for flash-ROM writing
SFR(ROM_DATA_H,	0x8F);	// data high byte for flash-ROM writing
SFR(ROM_CTRL,	0x86);	// WriteOnly: flash-ROM control
#define ROM_CMD_PROG      0x9A      // WriteOnly: flash-ROM word program operation command, for changing some ROM bit of a word from 1 to 0
#define ROM_CMD_ERASE     0xA6      // WriteOnly: flash-ROM sector erase operation command, for changing all ROM bit of 1KBytes from 0 to 1
//sfr ROM_STATUS      = 0x86;         // ReadOnly: flash-ROM status
#define ROM_STATUS        ROM_CTRL
#define bROM_ADDR_OK      0x40      // ReadOnly: flash-ROM operation address valid flag, can be reviewed before or after operation: 0=invalid parameter, 1=address valid
#define bROM_CMD_ERR      0x02      // ReadOnly: flash-ROM operation command error flag: 0=command accepted, 1=unknown command
#define bROM_CMD_TOUT     0x01      // ReadOnly: flash-ROM operation result: 0=success, 1=operation time out

/*  Port Registers  */
SFR(P0,	0x80);	// port 0 input & output
   SBIT(UDCD,	0x80, 7);	// DCD input for UART1
   SBIT(URI,	0x80, 6);	// RI input for UART1
   SBIT(UDSR,	0x80, 5);	// DSR input for UART1
   SBIT(UCTS,	0x80, 4);	// CTS input for UART1
   SBIT(TXD_,	0x80, 3);	// alternate pin for TXD of UART0
   SBIT(RXD_,	0x80, 2);	// alternate pin for RXD of UART0
   SBIT(URTS,	0x80, 1);	// RTS output for UART1
   SBIT(UDTR,	0x80, 0);	// DTR output for UART1
SFR(P0_DIR,	0xC4);	// port 0 direction
#define bUDCD             0x80      // DCD input for UART1
#define bURI              0x40      // RI input for UART1
#define bUDSR             0x20      // DSR input for UART1
#define bUCTS             0x10      // CTS input for UART1
#define bTXD_             0x08      // alternate pin for TXD of UART0
#define bRXD_             0x04      // alternate pin for RXD of UART0
#define bURTS             0x02      // RTS output for UART1
#define bUDTR             0x01      // DTR output for UART1
SFR(P0_PU,	0xC5);	// port 0 pullup enable
SFR(P1,	0x90);	// port 1 input & output, not 5VT
   SBIT(AIN7,	0x90, 7);	// AIN7 for ADC, not 5VT
   SBIT(AIN6,	0x90, 6);	// AIN6 for ADC, not 5VT
   SBIT(AIN5,	0x90, 5);	// AIN5 for ADC, not 5VT
   SBIT(AIN4,	0x90, 4);	// AIN4 for ADC, not 5VT
   SBIT(AIN3,	0x90, 3);	// AIN3 for ADC, not 5VT
   SBIT(AIN2,	0x90, 2);	// AIN2 for ADC, not 5VT
   SBIT(AIN1,	0x90, 1);	// AIN1 for ADC, not 5VT
   SBIT(AIN0,	0x90, 0);	// AIN0 for ADC, not 5VT
   SBIT(SCK,	0x90, 7);	// serial clock for SPI0, not 5VT
   SBIT(MISO,	0x90, 6);	// master serial data input or slave serial data output for SPI0, not 5VT
   SBIT(MOSI,	0x90, 5);	// master serial data output or slave serial data input for SPI0, not 5VT
   SBIT(SCS,	0x90, 4);	// slave chip-selection input for SPI0, not 5VT
   SBIT(PWM3,	0x90, 2);	// PWM output for timer3, not 5VT
   SBIT(CAP3,	0x90, 2);	// capture input for timer3, not 5VT
   SBIT(T2EX,	0x90, 1);	// external trigger input for timer2 reload & capture, not 5VT
   SBIT(CAP2,	0x90, 1);	// capture2 input for timer2, not 5VT
   SBIT(T2,	0x90, 0);	// external count input, not 5VT
   SBIT(CAP1,	0x90, 0);	// capture1 input for timer2, not 5VT
SFR(P1_IE,	0xB9);	// port 1 input enable
#define bSCK              0x80      // serial clock for SPI0
#define bMISO             0x40      // master serial data input or slave serial data output for SPI0
#define bMOSI             0x20      // master serial data output or slave serial data input for SPI0
#define bSCS              0x10      // slave chip-selection input for SPI0
#define bPWM3             0x04      // PWM output for timer3
#define bCAP3             bPWM3     // capture input for timer3
#define bT2EX             0x02      // external trigger input for timer2 reload & capture
#define bCAP2             bT2EX     // capture2 input for timer2
#define bT2               0x01      // external count input or clock output for timer2
#define bCAP1             bT2       // capture1 input for timer2
SFR(P1_DIR,	0xBA);	// port 1 direction
SFR(P1_PU,	0xBB);	// port 1 pullup enable
SFR(P2,	0xA0);	// port 2 input & output
   SBIT(TXD1,	0xA0, 7);	// TXD output for UART1
   SBIT(DA7,	0xA0, 7);	// address 7 output for direct low address mode
   SBIT(RXD1,	0xA0, 6);	// RXD input for UART1
   SBIT(TNOW,	0xA0, 5);	// tx now output for UART1, indicate transmitting
   SBIT(PWM2,	0xA0, 5);	// second PWM output for PWM1
   SBIT(T2EX_,	0xA0, 5);	// alternate pin for T2EX
   SBIT(CAP2_,	0xA0, 5);	// alternate pin for CAP2
   SBIT(PWM1,	0xA0, 4);	// PWM output for PWM1
   SBIT(SCK1,	0xA0, 3);	// serial clock output for SPI1
   SBIT(MISO1,	0xA0, 2);	// master serial data input for SPI1
   SBIT(MOSI1,	0xA0, 1);	// master serial data output for SPI1
SFR(P2_DIR,	0xBC);	// port 2 direction
#define bTXD1             0x80      // TXD output for UART1
#define bDA7              0x80      // address 7 output for direct low address mode
#define bRXD1             0x40      // RXD input for UART1
#define bTNOW             0x20      // tx now output for UART1, indicate transmitting
#define bPWM2             0x20      // second PWM output for PWM1
#define bT2EX_            0x20      // alternate pin for T2EX
#define bCAP2_            bT2EX_    // alternate pin for CAP2
#define bPWM1             0x10      // PWM output for PWM1
#define bSCK1             0x08      // serial clock output for SPI1
#define bMISO1            0x04      // master serial data input for SPI1
#define bMOSI1            0x02      // master serial data output for SPI1
SFR(P2_PU,	0xBD);	// port 2 pullup enable
SFR(P3,	0xB0);	// port 3 input & output
   SBIT(RD,	0xB0, 7);	// xdata or xBUS read strobe output
   SBIT(WR,	0xB0, 6);	// xdata or xBUS write strobe output
   SBIT(DA6,	0xB0, 5);	// address 6 output for direct low address mode
   SBIT(T1,	0xB0, 5);	// external count input for timer1
   SBIT(LEDC,	0xB0, 4);	// LEDC clock output for LED
   SBIT(XCS0,	0xB0, 4);	// xBUS chip-selection 0# output, for address range 0x4000~0x7FFF
   SBIT(T0,	0xB0, 4);	// external count input for timer0
   SBIT(LED1,	0xB0, 3);	// LED1 data output
   SBIT(INT1,	0xB0, 3);	// external interrupt 1 input
   SBIT(LED0,	0xB0, 2);	// LED0 data output
   SBIT(INT0,	0xB0, 2);	// external interrupt 0 input
   SBIT(TXD,	0xB0, 1);	// TXD output for UART0
   SBIT(RXD,	0xB0, 0);	// RXD input for UART0
SFR(P3_DIR,	0xBE);	// port 3 direction
#define bRD               0x80      // xdata or xBUS read strobe output
#define bWR               0x40      // xdata or xBUS write strobe output
#define bDA6              0x20      // address 6 output for direct low address mode
#define bT1               0x20      // external count input for timer1
#define bLEDC             0x10      // LEDC clock output for LED
#define bXCS0             0x10      // xBUS chip-selection 0# output, for address range 0x4000~0x7FFF
#define bT0               0x10      // external count input for timer0
#define bLED1             0x08      // LED1 data output
#define bINT1             0x08      // external interrupt 1 input
#define bLED0             0x04      // LED0 data output
#define bINT0             0x04      // external interrupt 0 input
#define bTXD              0x02      // TXD output for UART0
#define bRXD              0x01      // RXD input for UART0
SFR(P3_PU,	0xBF);	// port 3 pullup enable
SFR(P4_OUT,	0xC0);	// port 4 output
   SBIT(SCK_,	0xC0, 7);	// alternate pin for SCK
   SBIT(SCS_,	0xC0, 6);	// alternate pin for SCS
   SBIT(PWM2_,	0xC0, 5);	// alternate pin for PWM2
   SBIT(LED3,	0xC0, 4);	// LED3 data output
   SBIT(TNOW_,	0xC0, 4);	// alternate pin for TNOW
   SBIT(TXD1_,	0xC0, 4);	// alternate pin for TXD1
   SBIT(PWM1_,	0xC0, 3);	// alternate pin for PWM1
   SBIT(PWM3_,	0xC0, 2);	// alternate pin for PWM3
   SBIT(CAP3_,	0xC0, 2);	// alternate pin for CAP3
   SBIT(LED2,	0xC0, 0);	// LED2 data output
   SBIT(RXD1_,	0xC0, 0);	// alternate pin for RXD1
SFR(P4_IN,	0xC1);	// ReadOnly: port 4 input
#define bSCK_             0x80      // alternate pin for SCK, not 5VT
#define bSCS_             0x40      // alternate pin for SCS, not 5VT
#define bPWM2_            0x20      // alternate pin for PWM2
#define bLED3             0x10      // LED3 data output
#define bTNOW_            0x10      // alternate pin for TNOW
#define bTXD1_            bTNOW_    // alternate pin for TXD1
#define bPWM1_            0x08      // alternate pin for PWM1
#define bPWM3_            0x04      // alternate pin for PWM3
#define bCAP3_            bPWM3_    // alternate pin for CAP3
#define bLED2             0x01      // LED2 data output
#define bRXD1_            0x01      // alternate pin for RXD1
SFR(P4_DIR,	0xC2);	// port 4 direction
SFR(P4_PU,	0xC3);	// port 4 pullup enable
SFR(P5_IN,	0xC7);	// ReadOnly: port 5 input
#define bRST              0x80      // ReadOnly: pin RST input, not 5VT
#define bIO_INT_ACT       0x40      // ReadOnly: GPIO interrupt request action status
#define bHP               0x20      // ReadOnly: pin HP input
#define bHM               0x10      // ReadOnly: pin HM input
#define bDP               0x02      // ReadOnly: pin DP input
#define bDM               0x01      // ReadOnly: pin DM input
//sfr P4_CFG          = 0xC7;         // port 4 config
#define P4_CFG            P5_IN
#define bSPI0_PIN_X       0x08      // SPI0 SCS/SCK alternate pin enable: 0=SCS/SCK on P1.4/P1.7, 1=SCS/SCK on P4.6/P4.7
#define bP4_DRV           0x04      // P4 driving capability: 0=5mA, 1=20mA
SFR(PORT_CFG,	0xC6);	// port 0/1/2/3 config
#define bP3_DRV           0x80      // P3 driving capability: 0=5mA, 1=20mA
#define bP2_DRV           0x40      // P2 driving capability: 0=5mA, 1=20mA
#define bP1_DRV           0x20      // P1 driving capability: 0=5mA, 1=10mA
#define bP0_DRV           0x10      // P0 driving capability: 0=5mA, 1=20mA
#define bP3_OC            0x08      // P3 open-drain output enable: 0=push-pull output, 1=open-drain output
#define bP2_OC            0x04      // P2 open-drain output enable: 0=push-pull output, 1=open-drain output
#define bP1_OC            0x02      // P1 open-drain output enable: 0=push-pull output, 1=open-drain output
#define bP0_OC            0x01      // P0 open-drain output enable: 0=push-pull output, 1=open-drain output
// bPn_OC & Pn_DIR & Pn_PU: pin input & output configuration for Pn (n=0/1/2/3)
//   0 0 0:  input only, without pullup resistance
//   0 0 1:  input only, with pullup resistance
//   0 1 x:  push-pull output, strong driving high level and low level
//   1 0 0:  open-drain output without pullup, support input
//   1 1 0:  open-drain output without pullup, support input, just driving high level strongly for 2 clocks if turning output level from low to high
//   1 0 1:  quasi-bidirectional (simulated 8051 mode), open-drain output with pullup resistance
//   1 1 1:  quasi-bidirectional (standard 8051 mode), open-drain output with pullup resistance, just driving high level strongly for 2 clocks if turning output level from low to high
SFR(PIN_FUNC,	0xCE);	// pin function selection
#define bPWM1_PIN_X       0x80      // PWM1/PWM2 alternate pin enable: 0=PWM1/PWM2 on P2.4/P2.5, 1=PWM1/PWM2 on P4.3/P4.5
#define bTMR3_PIN_X       0x40      // PWM3/CAP3 alternate pin enable: 0=PWM3/CAP3 on P1.2, 1=PWM3/CAP3 on P4.2
#define bT2EX_PIN_X       0x20      // T2EX/CAP2 alternate pin enable: 0=T2EX/CAP2 on P1.1, 1=T2EX/CAP2 on P2.5
#define bUART0_PIN_X      0x10      // UART0 alternate pin enable: 0=RXD0/TXD0 on P3.0/P3.1, 1=RXD0/TXD0 on P0.2/P0.3
#define bXBUS_EN          0x08      // xBUS function enable: 0=disable, 1=enable port 0 used as data bus and P3.6/P3.7 used as bus writing/reading strobe during accessing xBUS
#define bXBUS_CS_OE       0x04      // xBUS chip-selection output enable: 0=disable output,
                                    //   1=output CS0 (chip-selection 0#, low action) at P3.4, output inversion of address_15 (be equal to CS1, low action) at P3.3 if ALE disabled
#define bXBUS_AH_OE       0x02      // xBUS high address output enable: 0=disable output, 1=output address_8~15 at P2.0~P2.7 during accessing xBUS by MOVX_@DPTR instruction
#define bXBUS_AL_OE       0x01      // xBUS low address output enable: 0=multiplex low address and data bus during accessing xBUS, 1=output address_0~7 at P4.0~P4.5 & P3.5 & P2.7 directly
SFR(XBUS_AUX,	0xA2);	// xBUS auxiliary setting
#define bUART0_TX         0x80      // ReadOnly: indicate UART0 transmittal status
#define bUART0_RX         0x40      // ReadOnly: indicate UART0 receiving status
#define bSAFE_MOD_ACT     0x20      // ReadOnly: safe mode action status
#define bALE_CLK_EN       0x10      // enable ALE output 1/12 Fsys clock during non xBUS operation
#define GF2               0x08      // general purpose flag bit 2
#define bDPTR_AUTO_INC    0x04      // enable DPTR auto increase if finished MOVX_@DPTR instruction
#define DPS               0x01      // dual DPTR selection: 0=DPTR0 selected, 1=DPTR1 selected
SFR(XBUS_SPEED,	0xFD);	// xBUS speed config
#define bXBUS1_SETUP      0x80      // xBUS chip-selection 1# setup time: 0=2 clocks, 1=3 clocks
#define bXBUS1_HOLD       0x40      // xBUS chip-selection 1# hold time: 0=1 clocks, 1=2 clocks
#define bXBUS1_WIDTH1     0x20      // xBUS chip-selection 1# access pulse width high bit
#define bXBUS1_WIDTH0     0x10      // xBUS chip-selection 1# access pulse width low bit
#define MASK_XBUS1_WIDTH  0x30      // bit mask of xBUS chip-selection 1# access pulse width
// bXBUSn_WIDTH1 & bXBUSn_WIDTH0: read or write pulse width for xBUS chip-selection n# peripheral
//   00: 2 clocks
//   01: 4 clocks
//   10: 8 clocks
//   11: 16 clocks
#define bXBUS0_SETUP      0x08      // xBUS chip-selection 0# setup time: 0=2 clocks, 1=3 clocks
#define bXBUS0_HOLD       0x04      // xBUS chip-selection 0# hold time: 0=1 clocks, 1=2 clocks
#define bXBUS0_WIDTH1     0x02      // xBUS chip-selection 0# access pulse width high bit
#define bXBUS0_WIDTH0     0x01      // xBUS chip-selection 0# access pulse width low bit
#define MASK_XBUS0_WIDTH  0x03      // bit mask of xBUS chip-selection 0# access pulse width

/*  Timer0/1 Registers  */
SFR(TCON,	0x88);	// timer 0/1 control and external interrupt control
   SBIT(TF1,	0x88, 7);	// timer1 overflow & interrupt flag, auto cleared when MCU enter interrupt routine
   SBIT(TR1,	0x88, 6);	// timer1 run enable
   SBIT(TF0,	0x88, 5);	// timer0 overflow & interrupt flag, auto cleared when MCU enter interrupt routine
   SBIT(TR0,	0x88, 4);	// timer0 run enable
   SBIT(IE1,	0x88, 3);	// INT1 interrupt flag, auto cleared when MCU enter interrupt routine
   SBIT(IT1,	0x88, 2);	// INT1 interrupt type: 0=low level action, 1=falling edge action
   SBIT(IE0,	0x88, 1);	// INT0 interrupt flag, auto cleared when MCU enter interrupt routine
   SBIT(IT0,	0x88, 0);	// INT0 interrupt type: 0=low level action, 1=falling edge action
SFR(TMOD,	0x89);	// timer 0/1 mode
#define bT1_GATE          0x80      // gate control of timer1: 0=timer1 run enable while TR1=1, 1=timer1 run enable while P3.3 (INT1) pin is high and TR1=1
#define bT1_CT            0x40      // counter or timer mode selection for timer1: 0=timer, use internal clock, 1=counter, use P3.5 (T1) pin falling edge as clock
#define bT1_M1            0x20      // timer1 mode high bit
#define bT1_M0            0x10      // timer1 mode low bit
#define MASK_T1_MOD       0x30      // bit mask of timer1 mode
// bT1_M1 & bT1_M0: timer1 mode
//   00: mode 0, 13-bit timer or counter by cascaded TH1 and lower 5 bits of TL1, the upper 3 bits of TL1 are ignored
//   01: mode 1, 16-bit timer or counter by cascaded TH1 and TL1
//   10: mode 2, TL1 operates as 8-bit timer or counter, and TH1 provide initial value for TL1 auto-reload
//   11: mode 3, stop timer1
#define bT0_GATE          0x08      // gate control of timer0: 0=timer0 run enable while TR0=1, 1=timer0 run enable while P3.2 (INT0) pin is high and TR0=1
#define bT0_CT            0x04      // counter or timer mode selection for timer0: 0=timer, use internal clock, 1=counter, use P3.4 (T0) pin falling edge as clock
#define bT0_M1            0x02      // timer0 mode high bit
#define bT0_M0            0x01      // timer0 mode low bit
#define MASK_T0_MOD       0x03      // bit mask of timer0 mode
// bT0_M1 & bT0_M0: timer0 mode
//   00: mode 0, 13-bit timer or counter by cascaded TH0 and lower 5 bits of TL0, the upper 3 bits of TL0 are ignored
//   01: mode 1, 16-bit timer or counter by cascaded TH0 and TL0
//   10: mode 2, TL0 operates as 8-bit timer or counter, and TH0 provide initial value for TL0 auto-reload
//   11: mode 3, TL0 is 8-bit timer or counter controlled by standard timer0 bits, TH0 is 8-bit timer using TF1 and controlled by TR1, timer1 run enable if it is not mode 3
SFR(TL0,	0x8A);	// low byte of timer 0 count
SFR(TL1,	0x8B);	// high byte of timer 1 count
SFR(TH0,	0x8C);	// low byte of timer 0 count
SFR(TH1,	0x8D);	// high byte of timer 1 count

