atc1441/CH559sdccUSBHost/CH559.h
#define XDATA_RAM_SIZE    0x1800    // size of expanded xRAM, xdata SRAM embedded chip
#define XDATA_XBUS_ADDR   0x4000    // xdata xBUS start address
#define XDATA_XBUS_CS0    0x4000    // xdata xBUS chip-selection 0#
#define XDATA_XCS0_SIZE   0x4000    // size of xdata xBUS chip-selection 0#: @0x4000~0x7FFF
#define XDATA_XBUS_CS1    0x8000    // xdata xBUS chip-selection 1#
#define XDATA_XCS1_SIZE   0x8000    // size of xdata xBUS chip-selection 1#: @0x8000~0xFFFF

/*  USB auxiliary Registers on xDATA, xSFR  */
#define REG_USB_AUX_BASE  0x2440    // USB auxiliary registers base address
#ifndef NO_XSFR_DEFINE
__at (0x2446) UINT8XV  UEP4_1_MOD;  // endpoint 4/1 mode
__at (0x2546) UINT8PV  pUEP4_1_MOD;
#else
extern __xdata uint8_tV  UEP4_1_MOD;
extern uint8_tPV pUEP4_1_MOD;
#endif
#define bUEP1_RX_EN       0x80      // enable USB endpoint 1 receiving (OUT)
#define bUEP1_TX_EN       0x40      // enable USB endpoint 1 transmittal (IN)
#define bUEP1_BUF_MOD     0x10      // buffer mode of USB endpoint 1
// bUEPn_RX_EN & bUEPn_TX_EN & bUEPn_BUF_MOD: USB endpoint 1/2/3 buffer mode, buffer start address is UEPn_DMA
//   0 0 x:  disable endpoint and disable buffer
//   1 0 0:  64 bytes buffer for receiving (OUT endpoint)
//   1 0 1:  dual 64 bytes buffer by toggle bit bUEP_R_TOG selection for receiving (OUT endpoint), total=128bytes
//   0 1 0:  64 bytes buffer for transmittal (IN endpoint)
//   0 1 1:  dual 64 bytes buffer by toggle bit bUEP_T_TOG selection for transmittal (IN endpoint), total=128bytes
//   1 1 0:  64 bytes buffer for receiving (OUT endpoint) + 64 bytes buffer for transmittal (IN endpoint), total=128bytes
//   1 1 1:  dual 64 bytes buffer by bUEP_R_TOG selection for receiving (OUT endpoint) + dual 64 bytes buffer by bUEP_T_TOG selection for transmittal (IN endpoint), total=256bytes
#define bUEP4_RX_EN       0x08      // enable USB endpoint 4 receiving (OUT)
#define bUEP4_TX_EN       0x04      // enable USB endpoint 4 transmittal (IN)
// bUEP4_RX_EN & bUEP4_TX_EN: USB endpoint 4 buffer mode, buffer start address is UEP0_DMA
//   0 0:  single 64 bytes buffer for endpoint 0 receiving & transmittal (OUT & IN endpoint)
//   1 0:  single 64 bytes buffer for endpoint 0 receiving & transmittal (OUT & IN endpoint) + 64 bytes buffer for endpoint 4 receiving (OUT endpoint), total=128bytes
//   0 1:  single 64 bytes buffer for endpoint 0 receiving & transmittal (OUT & IN endpoint) + 64 bytes buffer for endpoint 4 transmittal (IN endpoint), total=128bytes
//   1 1:  single 64 bytes buffer for endpoint 0 receiving & transmittal (OUT & IN endpoint)
//           + 64 bytes buffer for endpoint 4 receiving (OUT endpoint) + 64 bytes buffer for endpoint 4 transmittal (IN endpoint), total=192bytes
#ifndef NO_XSFR_DEFINE
__at (0x2447) UINT8XV  UEP2_3_MOD; // endpoint 2/3 mode 
__at (0x2547) UINT8PV  pUEP2_3_MOD;
#else
extern __xdata uint8_tV  UEP2_3_MOD;
extern uint8_tPV pUEP2_3_MOD;
#endif
#define bUEP3_RX_EN       0x80      // enable USB endpoint 3 receiving (OUT)
#define bUEP3_TX_EN       0x40      // enable USB endpoint 3 transmittal (IN)
#define bUEP3_BUF_MOD     0x10      // buffer mode of USB endpoint 3
#define bUEP2_RX_EN       0x08      // enable USB endpoint 2 receiving (OUT)
#define bUEP2_TX_EN       0x04      // enable USB endpoint 2 transmittal (IN)
#define bUEP2_BUF_MOD     0x01      // buffer mode of USB endpoint 2
//unsigned short volatile xdata UEP0_DMA    _at_ 0x2448;   // endpoint 0&4 buffer start address, must even address, big-endian
#ifndef NO_XSFR_DEFINE
__at (0x2448) UINT8XV  UEP0_DMA_H; 
__at (0x2449) UINT8XV  UEP0_DMA_L;
__at (0x2548) UINT8XV  pUEP0_DMA_H; 
__at (0x2549) UINT8XV  pUEP0_DMA_L;
#else
extern __xdata uint8_tV  UEP0_DMA_H;
extern __xdata uint8_tV  UEP0_DMA_L;
extern uint8_tPV pUEP0_DMA_H;
extern uint8_tPV pUEP0_DMA_L;
#endif
#define UEP0_DMA          (unsigned short volatile) UEP0_DMA_H
#define pUEP0_DMA         (unsigned short volatile) pUEP0_DMA_H
//unsigned short volatile xdata UEP1_DMA    _at_ 0x244A;   // endpoint 1 buffer start address, must even address, big-endian
#ifndef NO_XSFR_DEFINE
__at (0x244A) UINT8XV  UEP1_DMA_H; 
__at (0x244B) UINT8XV  UEP1_DMA_L;
__at (0x254A) UINT8XV  pUEP1_DMA_H; 
__at (0x254B) UINT8XV  pUEP1_DMA_L;
#else
extern __xdata uint8_tV  UEP1_DMA_H;
extern __xdata uint8_tV  UEP1_DMA_L;
extern uint8_tPV pUEP1_DMA_H;
extern uint8_tPV pUEP1_DMA_L;
#endif
#define UEP1_DMA          (unsigned short volatile) UEP1_DMA_H
#define pUEP1_DMA         (unsigned short volatile) pUEP1_DMA_H
//unsigned short volatile __xdata UEP2_DMA    __at 0x244C;   // endpoint 2 buffer start address, must even address, big-endian
#ifndef NO_XSFR_DEFINE

//typedef unsigned char volatile __xdata    UINT8XV;
//typedef unsigned char volatile __pdata    UINT8PV;

//SFR16(UEP2_DMA,	0x244C);	// endpoint 2 buffer start address, little-endian
//SFRX(UEP2_DMA_L,	0x244D);	// endpoint 2 buffer start address low byte
//SFRX(UEP2_DMA_H,	0x244C);	// endpoint 2 buffer start address high byte
__xdata __at (0x244C) unsigned short volatile  UEP2_DMA; 
__xdata __at (0x244D) unsigned char volatile  UEP2_DMA_L; 
__xdata __at (0x244C) unsigned char volatile  UEP2_DMA_H; 

//__at (0x244C) UINT8XV  UEP2_DMA_H; 
//__at (0x244D) UINT8XV  UEP2_DMA_L;
__at (0x254C) UINT8XV  pUEP2_DMA_H; 
__at (0x254D) UINT8XV  pUEP2_DMA_L;
#else
extern __xdata uint8_tV  UEP2_DMA_H;
extern __xdata uint8_tV  UEP2_DMA_L;
extern uint8_tPV pUEP2_DMA_H;
extern uint8_tPV pUEP2_DMA_L;
#endif
//#define UEP2_DMA          (unsigned short volatile) UEP2_DMA_H
//#define pUEP2_DMA         (unsigned short volatile) pUEP2_DMA_H
//unsigned short volatile __xdata UEP3_DMA    __at 0x244E;   // endpoint 3 buffer start address, must even address, big-endian
#ifndef NO_XSFR_DEFINE
//SFR16(UEP3_DMA,	0x244E);	// endpoint 3 buffer start address, little-endian
//SFRX(UEP3_DMA_L,	0x244F);	// endpoint 3 buffer start address low byte
//SFRX(UEP3_DMA_H,	0x244E);	// endpoint 3 buffer start address high byte
__xdata __at (0x244E) unsigned short volatile  UEP3_DMA; 
__xdata __at (0x244F) unsigned char volatile  UEP3_DMA_L; 
__xdata __at (0x244E) unsigned char volatile  UEP3_DMA_H; 

//__at (0x244E) UINT8XV  UEP3_DMA_H; 
//__at (0x244F) UINT8XV  UEP3_DMA_L;
__at (0x254E) UINT8XV  pUEP3_DMA_H; 
__at (0x254F) UINT8XV  pUEP3_DMA_L;
#else
extern __xdata uint8_tV  UEP3_DMA_H;
extern __xdata uint8_tV  UEP3_DMA_L;
extern uint8_tPV pUEP3_DMA_H;
extern uint8_tPV pUEP3_DMA_L;
#endif
//#define UEP3_DMA          (unsigned short volatile) UEP3_DMA_H
//#define pUEP3_DMA         (unsigned short volatile) pUEP3_DMA_H
//__at (0x2447) UINT8XV  UH_EP_MOD; 
#define UH_EP_MOD         UEP2_3_MOD
#define pUH_EP_MOD       pUEP2_3_MOD
#define bUH_EP_TX_EN      0x40      // enable USB host OUT endpoint transmittal
#define bUH_EP_TBUF_MOD   0x10      // buffer mode of USB host OUT endpoint
// bUH_EP_TX_EN & bUH_EP_TBUF_MOD: USB host OUT endpoint buffer mode, buffer start address is UH_TX_DMA
//   0 x:  disable endpoint and disable buffer
//   1 0:  64 bytes buffer for transmittal (OUT endpoint)
//   1 1:  dual 64 bytes buffer by toggle bit bUH_T_TOG selection for transmittal (OUT endpoint), total=128bytes
#define bUH_EP_RX_EN      0x08      // enable USB host IN endpoint receiving
#define bUH_EP_RBUF_MOD   0x01      // buffer mode of USB host IN endpoint
// bUH_EP_RX_EN & bUH_EP_RBUF_MOD: USB host IN endpoint buffer mode, buffer start address is UH_RX_DMA
//   0 x:  disable endpoint and disable buffer
//   1 0:  64 bytes buffer for receiving (IN endpoint)
//   1 1:  dual 64 bytes buffer by toggle bit bUH_R_TOG selection for receiving (IN endpoint), total=128bytes
//unsigned short volatile xdata UH_RX_DMA   _at_ 0x244C;   // host rx endpoint buffer start address, big-endian
#define UH_RX_DMA         UEP2_DMA
#define pUH_RX_DMA       pUEP2_DMA
//__xdata uint8_tV  UH_RX_DMA_H _at_ 0x244C;   // host rx endpoint buffer start address high byte
#define UH_RX_DMA_H       UEP2_DMA_H
#define pUH_RX_DMA_H     pUEP2_DMA_H
//__xdata uint8_tV  UH_RX_DMA_L _at_ 0x244D;   // host rx endpoint buffer start address low byte
#define UH_RX_DMA_L       UEP2_DMA_L
#define pUH_RX_DMA_L     pUEP2_DMA_L
//unsigned short volatile xdata UH_TX_DMA   _at_ 0x244E;   // host rx endpoint buffer start address, big-endian
#define UH_TX_DMA         UEP3_DMA
#define pUH_TX_DMA       pUEP3_DMA
//__xdata uint8_tV  UH_TX_DMA_H _at_ 0x244E;   // host rx endpoint buffer start address high byte
#define UH_TX_DMA_H       UEP3_DMA_H
#define pUH_TX_DMA_H     pUEP3_DMA_H
//__xdata uint8_tV  UH_TX_DMA_L _at_ 0x244F;   // host rx endpoint buffer start address low byte
#define UH_TX_DMA_L       UEP3_DMA_L
#define pUH_TX_DMA_L     pUEP3_DMA_L

/*  LED Registers on xDATA, xSFR  */
#define REG_LED_BASE      0x2880    // LED registers base address
#ifndef NO_XSFR_DEFINE
__at (0x2880) UINT8XV  LED_STAT; 
__at (0x2980) UINT8PV  pLED_STAT;
#else
extern __xdata uint8_tV  LED_STAT;
extern uint8_tPV pLED_STAT;
#endif
#define bLED_IF_DMA_END   0x80      // interrupt flag for DMA completion, write 1 to clear or write LED_DMA_CN to clear
#define bLED_FIFO_EMPTY   0x40      // ReadOnly: indicate FIFO empty status
#define bLED_IF_FIFO_REQ  0x20      // interrupt flag for request FIFO data ( FIFO <=2), write 1 to clear
#define bLED_CLOCK        0x10      // ReadOnly: current LED clock level
#define MASK_LED_FIFO_CNT 0x07      // ReadOnly: bit mask of LED FIFO count
#ifndef NO_XSFR_DEFINE
__at (0x2881) UINT8XV  LED_CTRL; 
__at (0x2981) UINT8PV  pLED_CTRL;
#else
extern __xdata uint8_tV  LED_CTRL;
extern uint8_tPV pLED_CTRL;
#endif
#define bLED_CHAN_MOD1    0x80      // LED channel mode high bit
#define bLED_CHAN_MOD0    0x40      // LED channel mode low bit
#define MASK_LED_CHAN_MOD 0xC0      // bit mask of LED channel mode
// bLED_CHAN_MOD1 & bLED_CHAN_MOD0: LED channel mode
//   00: single channel output, LED0
//   01: dual channels output, LED0/1
//   10: 4 channels output, LED0~3
//   11: 4 channels output and LED2/3 from aux buffer, LED0~3
#define bLED_IE_FIFO_REQ  0x20      // enable interrupt for FIFO <=2
#define bLED_DMA_EN       0x10      // DMA enable and DMA interrupt enable for LED
#define bLED_OUT_EN       0x08      // LED output enable
#define bLED_OUT_POLAR    0x04      // LED output polarity: 0=pass, 1=invert
#define bLED_CLR_ALL      0x02      // force clear FIFO and count of LED
#define bLED_BIT_ORDER    0x01      // LED bit data order: 0=LSB first, 1=MSB first
#ifndef NO_XSFR_DEFINE
__at (0x2882) UINT8XV  LED_DATA; 
__at (0x2982) UINT8PV  pLED_DATA;
#else
extern __xdata uint8_tV  LED_DATA;
extern uint8_tPV pLED_DATA;
#endif
//__xdata uint8_tV  LED_FIFO_CN _at_ 0x2882;   // ReadOnly: FIFO count status
#define LED_FIFO_CN       LED_DATA
#ifndef NO_XSFR_DEFINE
__at (0x2883) UINT8XV  LED_CK_SE; 
__at (0x2983) UINT8PV  pLED_CK_SE;
#else
extern __xdata uint8_tV  LED_CK_SE;
extern uint8_tPV pLED_CK_SE;
#endif
//unsigned short volatile xdata LED_DMA     _at_ 0x2884;   // DMA address, must even address, big-endian, automatic increasing after DMA
#ifndef NO_XSFR_DEFINE
__at (0x2884) UINT8XV  LED_DMA_AH; 
__at (0x2885) UINT8XV  LED_DMA_AL; 
__at (0x2984) UINT8PV  pLED_DMA_AH;
__at (0x2985) UINT8PV  pLED_DMA_AL;
#else
extern __xdata uint8_tV  LED_DMA_AH;
extern __xdata uint8_tV  LED_DMA_AL;
extern uint8_tPV pLED_DMA_AH;
extern uint8_tPV pLED_DMA_AL;
#endif
#define LED_DMA           (unsigned short volatile) LED_DMA_AH
#define pLED_DMA          (unsigned short volatile) pLED_DMA_AH
#ifndef NO_XSFR_DEFINE
__at (0x2886) UINT8XV  LED_DMA_CN; 
__at (0x2986) UINT8PV  pLED_DMA_CN;
#else
extern __xdata uint8_tV  LED_DMA_CN;
extern uint8_tPV pLED_DMA_CN;
#endif
//unsigned short volatile xdata LED_DMA_X   _at_ 0x2888;   // aux buffer DMA address, must even address, big-endian, automatic increasing after DMA
#ifndef NO_XSFR_DEFINE
__at (0x2888) UINT8XV  LED_DMA_XH; 
__at (0x2889) UINT8XV  LED_DMA_XL; 
__at (0x2988) UINT8PV  pLED_DMA_XH;
__at (0x2989) UINT8PV  pLED_DMA_XL;
#else
extern __xdata uint8_tV  LED_DMA_XH;
extern __xdata uint8_tV  LED_DMA_XL;
extern uint8_tPV pLED_DMA_XH;
extern uint8_tPV pLED_DMA_XL;
#endif
#define LED_DMA_X         (unsigned short volatile) LED_DMA_XH
#define pLED_DMA_X        (unsigned short volatile) pLED_DMA_XH

